# Runtime Dependencies: Must Run First!

In [1]:
import numpy as np
import pandas as pd

# ### Bonus: Multiple Outputs Per Cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Module 5: Pandas

**Importing Pandas:**

```python
import pandas as pd
```

Pandas is an essential data science package for Python that brings DataFrame functionality into Python. DataFrames are built upon NumPy arrays, and allow us to set custom indicies, add column and row labels, and bring SQL-like and Excel-like operations possible.

## Module 5.1: Series & DataFrames

### Series

Let's start with a Series. A series is essentially a NumPy array underneath, with some added features. Let's go through some of them!

In [5]:
arr = np.array(range(50,71,2))
arr

ser = pd.Series(arr)
ser

array([50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70])

0     50
1     52
2     54
3     56
4     58
5     60
6     62
7     64
8     66
9     68
10    70
dtype: int64

As you can see, this looks a bit different than the array output. We now have data being formatted vertically in a table with the index on the right hand side.

By default, Pandas will assign a zero-indexed index if none is supplied. However, we can start changing some of these properties quickly.

Essential keyword arguments upon creation:

1) data

2) index

4) name

We've already used the data keyword to tell Python what data needs to be imported, and now we're going to add the name property. This is essentially a label for the data. These will come back in DataFrames as column names.

In [6]:
lst = ["Apples","Bananas","Grapes","Mangos","Avocados"]

ser = pd.Series(lst, name="Produce")
ser

0      Apples
1     Bananas
2      Grapes
3      Mangos
4    Avocados
Name: Produce, dtype: object

And we can even set a custom index if we don't want to use the one automatically generated!

Let's say we have a small list of employees with their ID number and name. It would make sense to have the ID # be the index!

In [10]:
loc = "https://raw.githubusercontent.com/mhall-simon/python/main/data/misc/arr-ID-and-names.csv"
arr = np.genfromtxt(loc, dtype=str, delimiter=',', skip_header=1)
arr

array([['399171', 'Matt'],
       ['168852', 'Aneli'],
       ['924754', 'Ryan'],
       ['401356', 'Dan'],
       ['324956', 'Lexi'],
       ['147378', 'Chris'],
       ['428043', 'Alex'],
       ['605116', 'John'],
       ['527494', 'Jasmine']], dtype='<U7')

Now, let's create the series with the custom index and employee names:

In [11]:
ser = pd.Series(arr[:,1], index=arr[:,0], name="Employees by ID")
ser

399171       Matt
168852      Aneli
924754       Ryan
401356        Dan
324956       Lexi
147378      Chris
428043       Alex
605116       John
527494    Jasmine
Name: Employees by ID, dtype: object

### DataFrame

Right now, we can create an indexed series (with one columnn of data and an index), but sometimes we have complex datasets that can't fit in a single column.

This is where the DataFrame comes in handy. We can now store and process more complex data!

Let's start with a really simple inventory example:

In [14]:
dct = {'partNum': [104,105,106], 'Quantity': [415,346,98], 'Price': [1.24, 2.15, 5.98], 'Cost': [0.78,1.56,3.12]}

df = pd.DataFrame(dct)
df

   partNum  Quantity  Price  Cost
0      104       415   1.24  0.78
1      105       346   2.15  1.56
2      106        98   5.98  3.12

Now, when we visualize the data structure you can see the column labels! Since no index was created, Pandas will automatically assign one!

In section 3, I'm going to cover how to generate DataFrames from various sources.

### Some DataFrame Attributes

*Pulled From Documentation or Summarized Desc*

| Attribute | Description |
| :---: | --- |
| `.index` | The Index (row labels) of the DataFrame |
| `.columns` | The column labels of the DataFrame |
| `.shape` | Dimensions of DataFrame |

In [19]:
df.index
df.columns
df.shape

RangeIndex(start=0, stop=3, step=1)

Index(['partNum', 'Quantity', 'Price', 'Cost'], dtype='object')

(3, 4)

### Some DataFrame Methods

*Pulled From Documentation or Summarized Desc*

| Method | Description |
| :---: | --- |
| `.info()` | Prints out info for DataFrame |
| `.describe()` | Prints out summary statistics |
| `.head()` | Print out top n rows of DataFrame, default to 5 |
| `.tail()` | Print out last n rows of DataFrame, default to 5 |

Just keep in mind that sometimes a summary statistic for a column doesn't make sense!

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   partNum   3 non-null      int64
 1   Quantity  3 non-null      int64
 2   Price     3 non-null      float64
 3   Cost      3 non-null      float64
dtypes: float64(2), int64(2)
memory usage: 224.0 bytes

In [23]:
df.describe()

       partNum    Quantity     Price     Cost
count      3.0    3.000000  3.000000  3.00000
mean     105.0  286.333333  3.123333  1.82000
std        1.0  166.710328  2.515439  1.19147
min      104.0   98.000000  1.240000  0.78000
25%      104.5  222.000000  1.695000  1.17000
50%      105.0  346.000000  2.150000  1.56000
75%      105.5  380.500000  4.065000  2.34000
max      106.0  415.000000  5.980000  3.12000

## Module 5.2: Indexing DataFrames

In Pandas, there's 3 main methods for indexing a DataFrame.

The first one allows us to easily subset a column (or more) from our DataFrame.

To start, I'm going to import a data set about COVID 19 vaccines. This CSV has vaccination info from the CDC, with the report being pulled on February 8th, 2021.

**Keep In Mind That You Can Always Reference This. You Don't Need to Memorize, But You Should Be Familiar Enough to Know Which One to Choose**

In [34]:
loc = "https://raw.githubusercontent.com/mhall-simon/python/main/data/covid/covid19_vaccinations_in_the_united_states.csv"

df = pd.read_csv(loc, header=2, index_col="State/Territory/Federal Entity")
df

                                Total Delivered  ...  People with 2 Doses Per 100K
State/Territory/Federal Entity                   ...
Alaska                                   248500  ...                          5579
Alabama                                  804100  ...                          1804
Arkansas                                 540050  ...                          3117
American Samoa                            29450  ...                          4450
Arizona                                 1186000  ...                          2216
...                                         ...  ...                           ...
Vermont                                  116075  ...                          4350
Washington                              1208600  ...                          2543
Wisconsin                                926300  ...                          2734
West Virginia                            357000  ...                          5843
Wyoming                                  101650  ...                          2890

[63 rows x 8 columns]

### Easily Accessing Columns

This is our first indexing method, to pull columns of data, and there are a few syntax styles:

#### Pulling Single Column

In [28]:
df['Total Delivered']

State/Territory/Federal Entity
Alaska             248500
Alabama            804100
Arkansas           540050
American Samoa      29450
Arizona           1186000
                   ...
Vermont            116075
Washington        1208600
Wisconsin          926300
West Virginia      357000
Wyoming            101650
Name: Total Delivered, Length: 63, dtype: int64

#### Pulling Multiple Columns

In [29]:
df[['Total Delivered','Total Administered']]

                                Total Delivered  Total Administered
State/Territory/Federal Entity
Alaska                                   248500              150934
Alabama                                  804100              467636
Arkansas                                 540050              401664
American Samoa                            29450               12259
Arizona                                 1186000              841018
...                                         ...                 ...
Vermont                                  116075               90328
Washington                              1208600              937926
Wisconsin                                926300              763252
West Virginia                            357000              323387
Wyoming                                  101650               76457

[63 rows x 2 columns]

#### Note About Single Column

If our column names have no spaces, we can quickly access a column like this too:

```python
df.col_name
```

### Indexing with `.loc[]`

We can also use the method `.loc[]` to index our DataFrames. This method uses the labels of rows/columns to index.

Just like 2D NumPy arrays, loc takes the arguments as `[row:row,col:col]`

#### Pulling a Row with `.loc()`

In [37]:
df.loc['Wisconsin']

Total Delivered                  926300.0
Total Administered               763252.0
Delivered per 100K                15909.0
Administered per 100K             13109.0
People with 1+ Doses             595912.0
People with 1+ Doses per 100K     10235.0
People with 2 Doses              159160.0
People with 2 Doses Per 100K       2734.0
Name: Wisconsin, dtype: float64

#### Pulling Range of Rows - All Columns

In [42]:
df.loc['Oklahoma':'Wisconsin',:]

                                Total Delivered  ...  People with 2 Doses Per 100K
State/Territory/Federal Entity                   ...
Oklahoma                                 734625  ...                          3817
Oregon                                   734950  ...                          3312
Pennsylvania                            2292500  ...                          2569
Puerto Rico                              624025  ...                          2168
Rhode Island                             192300  ...                          3342
Republic of Palau                          9200  ...                          1999
South Carolina                           684700  ...                          2315
South Dakota                             161150  ...                          4563
Tennessee                               1156975  ...                          3645
Texas                                   4402275  ...                          2783
Utah                                     493525  ...                          3253
Virginia                                1387775  ...                          2450
Veterans Health                         1733525  ...                             0
Virgin Islands                            20625  ...                          2403
Vermont                                  116075  ...                          4350
Washington                              1208600  ...                          2543
Wisconsin                                926300  ...                          2734

[17 rows x 8 columns]

#### Pulling Range of Rows, Select Columns

In [44]:
df.loc['Oregon':'Texas','Total Delivered':'Total Administered']

                                Total Delivered  Total Administered
State/Territory/Federal Entity
Oregon                                   734950              554440
Pennsylvania                            2292500             1441358
Puerto Rico                              624025              299694
Rhode Island                             192300              120484
Republic of Palau                          9200                3467
South Carolina                           684700              585692
South Dakota                             161150              133068
Tennessee                               1156975              805720
Texas                                   4402275             3322062

### Indexing with `.iloc[]`

Iloc uses purely integer-based indexing to find values for us! This means that we need to make sure our dataset is in an expected order.

#### Rows: Scalar

In [45]:
df.iloc[5]

Total Delivered                  37050.0
Total Administered               40333.0
Delivered per 100K                   NaN
Administered per 100K                NaN
People with 1+ Doses             26410.0
People with 1+ Doses per 100K        0.0
People with 2 Doses              13826.0
People with 2 Doses Per 100K         0.0
Name: Bureau of Prisons, dtype: float64

#### Rows: List

In [46]:
df.iloc[[2,4,8]]

                                Total Delivered  ...  People with 2 Doses Per 100K
State/Territory/Federal Entity                   ...
Arkansas                                 540050  ...                          3117
Arizona                                 1186000  ...                          2216
Connecticut                              740300  ...                          3568

[3 rows x 8 columns]

#### Rows: Slicing

In [47]:
df.iloc[2:5]

                                Total Delivered  ...  People with 2 Doses Per 100K
State/Territory/Federal Entity                   ...
Arkansas                                 540050  ...                          3117
American Samoa                            29450  ...                          4450
Arizona                                 1186000  ...                          2216

[3 rows x 8 columns]

#### Rows & Cols: Scalars

In [52]:
df.iloc[0,0]

248500

#### Rows & Cols: List

In [54]:
df.iloc[[12,18], [0,2]]

                                Total Delivered  Delivered per 100K
State/Territory/Federal Entity
Florida                                 3791925             17655.0
Idaho                                    266475             14911.0

#### Rows & Cols: Slicing

In [57]:
df.iloc[12:22, 0:4]

                                Total Delivered  ...  Administered per 100K
State/Territory/Federal Entity                   ...
Florida                                 3791925  ...                12141.0
Federated States of Micronesia            21900  ...                 7187.0
Georgia                                 1688075  ...                10998.0
Guam                                      51300  ...                17928.0
Hawaii                                   263000  ...                13704.0
Iowa                                     510550  ...                10946.0
Idaho                                    266475  ...                10945.0
Indian Health Svc                        492875  ...                    NaN
Illinois                                2089050  ...                11503.0
Indiana                                 1118350  ...                11137.0

[10 rows x 4 columns]

## Module 5.3: Importing Data Sets Overview

You've already seen some import statements above, but now I'm going to cover them on a high level!

Dig through the documentation to learn about all the little tweaks and tricks you can use upon import.

2 Essential Methods:

- Read CSV
- Read Excel

The most important thing to note about importing data is to look through the file in Excel!

You cannot properly import something if you don't know what it is!

I'm only going to cover the CSV method, as the two are very similar and have only slightly different tweaks.

### Using Read CSV

In GitHub, I have a CSV file downloaded from Yahoo Finance about Tesla's monthly stock performance over the last 5 years.

We can examine it here: https://github.com/mhall-simon/python/blob/main/data/misc/TSLA.csv

And the GitHub raw link is: https://raw.githubusercontent.com/mhall-simon/python/main/data/misc/TSLA.csv

Let's import it by just targeting a link:

In [63]:
loc = "https://raw.githubusercontent.com/mhall-simon/python/main/data/misc/TSLA.csv"

df = pd.read_csv(loc)
df.head()

         Date       Open       High        Low      Close  Adj Close     Volume
0  2016-03-01  38.849998  47.976002  36.299999  45.953999  45.953999  514610000
1  2016-04-01  48.966000  53.868000  46.650002  48.152000  48.152000  677536500
2  2016-05-01  48.299999  48.638000  40.731998  44.646000  44.646000  516537500
3  2016-06-01  44.296001  48.169998  37.574001  42.456001  42.456001  608364000
4  2016-07-01  41.228001  47.056000  41.200001  46.958000  46.958000  370319500

Pretty neat! However, a useful feature would be to index by Date, as that is a unique key for the data set.

Since the Date column is first, we're going to use `index_col=0` as a keyword argument.

Also, since it's Date/Time data, we should parse it into the proper format.

We do this by providing the argument `parse_dates=True`

In [64]:
loc = "https://raw.githubusercontent.com/mhall-simon/python/main/data/misc/TSLA.csv"

df = pd.read_csv(loc, index_col=0, parse_dates=True)
df.head()

                 Open       High        Low      Close  Adj Close     Volume
Date
2016-03-01  38.849998  47.976002  36.299999  45.953999  45.953999  514610000
2016-04-01  48.966000  53.868000  46.650002  48.152000  48.152000  677536500
2016-05-01  48.299999  48.638000  40.731998  44.646000  44.646000  516537500
2016-06-01  44.296001  48.169998  37.574001  42.456001  42.456001  608364000
2016-07-01  41.228001  47.056000  41.200001  46.958000  46.958000  370319500

Let's inspect the DataFrame now using `.info()`

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 61 entries, 2016-03-01 to 2021-02-12
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       61 non-null     float64
 1   High       61 non-null     float64
 2   Low        61 non-null     float64
 3   Close      61 non-null     float64
 4   Adj Close  61 non-null     float64
 5   Volume     61 non-null     int64
dtypes: float64(5), int64(1)
memory usage: 3.3 KB

There's a ton of other arguments, some being more useful than the others. As we keep progressing through training, try to see what keyword arguments I use to import data!

## Module 5.4: Date & Time Overview

Pandas also brings with it a new data type: DateTime.

This is very useful for using time series data, as we don't need to map information out into multiple columns.

If the DateTime data is the index, it makes processing time series data in Python very efficient!

Let's start with the same data set as above for Tesla stock:

In [66]:
loc = "https://raw.githubusercontent.com/mhall-simon/python/main/data/misc/TSLA.csv"

df = pd.read_csv(loc, index_col=0, parse_dates=True)
df.head()

                 Open       High        Low      Close  Adj Close     Volume
Date
2016-03-01  38.849998  47.976002  36.299999  45.953999  45.953999  514610000
2016-04-01  48.966000  53.868000  46.650002  48.152000  48.152000  677536500
2016-05-01  48.299999  48.638000  40.731998  44.646000  44.646000  516537500
2016-06-01  44.296001  48.169998  37.574001  42.456001  42.456001  608364000
2016-07-01  41.228001  47.056000  41.200001  46.958000  46.958000  370319500

### Extracting D-M-Y Information

In [69]:
df.index.day

Int64Index([ 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
             1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
             1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
             1,  1,  1,  1,  1,  1,  1,  1,  1, 12],
           dtype='int64', name='Date')

In [70]:
df.index.month

Int64Index([ 3,  4,  5,  6,  7,  8,  9, 10, 11, 12,  1,  2,  3,  4,  5,  6,  7,
             8,  9, 10, 11, 12,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12,
             1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12,  1,  2,  3,  4,  5,
             6,  7,  8,  9, 10, 11, 12,  1,  2,  2],
           dtype='int64', name='Date')

In [71]:
df.index.year

Int64Index([2016, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2016, 2017,
            2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017, 2017,
            2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018, 2018,
            2018, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019, 2019,
            2019, 2019, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020,
            2020, 2020, 2020, 2021, 2021, 2021],
           dtype='int64', name='Date')

These properties will become very useful when we want to index, slice, or even run SQL functionality on our time series data!

## Module 5.5: Multi-Indexed Data Sets

Above, you've only seen data with a single index. However, you can also have a multi-index!

These are excellent for when you have multiple indicies, and don't want to store information in columns.

### Importing Regularly:

In [77]:
loc = "https://github.com/mhall-simon/python/blob/main/data/misc/inventory-multi-index.xlsx?raw=true"

df = pd.read_excel(loc, parse_dates=True)
df

        Date  Part  Cost  Price  Sold
0 2020-03-01  A-01  0.24   0.75    98
1 2020-03-01  A-02  0.55   0.98    78
2 2020-03-01  B-02  3.98   5.02    15
3 2020-03-02  A-01  0.25   0.76   105
4 2020-03-02  B-02  3.80   5.00    25
5 2020-03-03  A-01  0.22   0.80   105
6 2020-03-03  A-02  0.61   1.02    55

### Importing Multi-Index:

In [78]:
loc = "https://github.com/mhall-simon/python/blob/main/data/misc/inventory-multi-index.xlsx?raw=true"

df = pd.read_excel(loc, parse_dates=True, index_col=[0,1])
df

                 Cost  Price  Sold
Date       Part
2020-03-01 A-01  0.24   0.75    98
           A-02  0.55   0.98    78
           B-02  3.98   5.02    15
2020-03-02 A-01  0.25   0.76   105
           B-02  3.80   5.00    25
2020-03-03 A-01  0.22   0.80   105
           A-02  0.61   1.02    55

Now, our data is formatted better! It's hierarchical between the date and part number!

I'm not going to go too in depth with Multi-Indexed Data Sets, but you should know that they exist!

### Accessing Row in Multi-Indexed Dataset (Outer Most Group)

In [81]:
df.loc['2020-03-01']

                 Cost  Price  Sold
Date       Part
2020-03-01 A-01  0.24   0.75    98
           A-02  0.55   0.98    78
           B-02  3.98   5.02    15

### Accessing Row in Multi-Indexed Dataset (Inner Most Group)

In [84]:
df.loc[('2020-03-01','A-01')]

Cost      0.24
Price     0.75
Sold     98.00
Name: (2020-03-01 00:00:00, A-01), dtype: float64

Tip: Multi-Indexed Datasets behave very-similarly to groupby objects!

## Module 5.6: Broadcasting Scalars

Just like with NumPy, we can broadcast scalars across our dataframe!

Since we're already familiar with how it works, we just need the general formula:

1. Index Subset (Optional)
2. Broadcast Scalar

It's pretty easy! And allows us to update information stored in DataFrames without creating new rows / cols!

Above, we imported a dataset of inventory prices and amount sold, let's do some basic operations on them!

In [85]:
loc = "https://github.com/mhall-simon/python/blob/main/data/misc/inventory-multi-index.xlsx?raw=true"

df = pd.read_excel(loc, parse_dates=True, index_col=[0,1])
df

                 Cost  Price  Sold
Date       Part
2020-03-01 A-01  0.24   0.75    98
           A-02  0.55   0.98    78
           B-02  3.98   5.02    15
2020-03-02 A-01  0.25   0.76   105
           B-02  3.80   5.00    25
2020-03-03 A-01  0.22   0.80   105
           A-02  0.61   1.02    55

### Broadcast Across Slice - Column

Oh no! Our costs were too low because we forgot tax. Let's add 8% to the cost column of the dataset:

In [87]:
df.Cost = df.Cost*1.08
df

                   Cost  Price  Sold
Date       Part
2020-03-01 A-01  0.2592   0.75    98
           A-02  0.5940   0.98    78
           B-02  4.2984   5.02    15
2020-03-02 A-01  0.2700   0.76   105
           B-02  4.1040   5.00    25
2020-03-03 A-01  0.2376   0.80   105
           A-02  0.6588   1.02    55

### Broadcast Across Slice - Row

Oh no! We forgot we have a 5% discount on the first day of the month. Let's easily correct this.

In [98]:
df.loc['2020-03-01','Price'] = df.loc['2020-03-01','Price']*0.95
df

                   Cost     Price  Sold
Date       Part
2020-03-01 A-01  0.2592  0.676875    98
           A-02  0.5940  0.884450    78
           B-02  4.2984  4.530550    15
2020-03-02 A-01  0.2700  0.760000   105
           B-02  4.1040  5.000000    25
2020-03-03 A-01  0.2376  0.800000   105
           A-02  0.6588  1.020000    55

These operations are easy—it's really just a question of knowing how to slice your data!

## Module 5.7: Row & Column-wise Operations

Just like with NumPy, we can also do element-wise operations with our DataFrames. Again, it's really just a practice of knowing how to properly slice your data!

### Creating New Column Based Upon Other Columns

Right now, we have a data frame with prices, quantity, and cost. Let's start working towards profitability for each part per day.

Here's how we would build a column named Gross, which is Price * Number Sold.

In [99]:
loc = "https://github.com/mhall-simon/python/blob/main/data/misc/inventory-multi-index.xlsx?raw=true"

df = pd.read_excel(loc, parse_dates=True, index_col=[0,1])
df

                 Cost  Price  Sold
Date       Part
2020-03-01 A-01  0.24   0.75    98
           A-02  0.55   0.98    78
           B-02  3.98   5.02    15
2020-03-02 A-01  0.25   0.76   105
           B-02  3.80   5.00    25
2020-03-03 A-01  0.22   0.80   105
           A-02  0.61   1.02    55

In [100]:
df['Gross'] = df.Price * df.Sold
df

                 Cost  Price  Sold   Gross
Date       Part
2020-03-01 A-01  0.24   0.75    98   73.50
           A-02  0.55   0.98    78   76.44
           B-02  3.98   5.02    15   75.30
2020-03-02 A-01  0.25   0.76   105   79.80
           B-02  3.80   5.00    25  125.00
2020-03-03 A-01  0.22   0.80   105   84.00
           A-02  0.61   1.02    55   56.10

Now, let's calculate Net, which is going to be Gross minus our total cost for the day.

In [101]:
df['Net'] = df.Gross - (df.Cost * df.Sold)
df

                 Cost  Price  Sold   Gross    Net
Date       Part
2020-03-01 A-01  0.24   0.75    98   73.50  49.98
           A-02  0.55   0.98    78   76.44  33.54
           B-02  3.98   5.02    15   75.30  15.60
2020-03-02 A-01  0.25   0.76   105   79.80  53.55
           B-02  3.80   5.00    25  125.00  30.00
2020-03-03 A-01  0.22   0.80   105   84.00  60.90
           A-02  0.61   1.02    55   56.10  22.55

Now, we can also figure out our margin. We'll calculate our margin as Net / Gross, and leave it in decimal terms (don't multiply by 100)

In [102]:
df['Margin'] = df.Net / df.Gross
df

                 Cost  Price  Sold   Gross    Net    Margin
Date       Part
2020-03-01 A-01  0.24   0.75    98   73.50  49.98  0.680000
           A-02  0.55   0.98    78   76.44  33.54  0.438776
           B-02  3.98   5.02    15   75.30  15.60  0.207171
2020-03-02 A-01  0.25   0.76   105   79.80  53.55  0.671053
           B-02  3.80   5.00    25  125.00  30.00  0.240000
2020-03-03 A-01  0.22   0.80   105   84.00  60.90  0.725000
           A-02  0.61   1.02    55   56.10  22.55  0.401961

If you're thinking that right now we're really only calculating new columns, you'd be right! We usually have our data formatted as new entries going vertically, within the columns.

Most of our row-wise operations come in SQL-functionality, when we calculate statistics for our columns or run groups, filters, and more!

### Applying Custom Functions

Usually, we want to keep our operations to run as broadcasting or element-wise operations with subsets and slices. However, sometimes we need to apply a function!

These are going to be slower, but when they're needed they're necessary!

We can write them with lambda functions.

Let's mark our products with the Note "High" to denote a high-margin product. Management defines any high margin product as one with at least a 65% profit margin.

In [106]:
df['Note'] = df.apply(lambda row: 'High' if row.Margin >= 0.65 else 'Low', axis=1)
df

                 Cost  Price  Sold   Gross    Net    Margin  Note
Date       Part
2020-03-01 A-01  0.24   0.75    98   73.50  49.98  0.680000  High
           A-02  0.55   0.98    78   76.44  33.54  0.438776   Low
           B-02  3.98   5.02    15   75.30  15.60  0.207171   Low
2020-03-02 A-01  0.25   0.76   105   79.80  53.55  0.671053  High
           B-02  3.80   5.00    25  125.00  30.00  0.240000   Low
2020-03-03 A-01  0.22   0.80   105   84.00  60.90  0.725000  High
           A-02  0.61   1.02    55   56.10  22.55  0.401961   Low

### Bonus Box: Nested Lambdas for Multiple Logic Checks

We can "nest" lambda functions to do multiple logic checks! Essentially, the else block is going to run another lambda!

Let's redo the above example and cast 3 margins. One for high (>65%), one for medium (>40%), and one for low.

In [109]:
df['Note'] = df.apply(lambda row: 'High' if row.Margin >= 0.65 else ('Medium' if row.Margin >= 0.4 else 'Low'), axis=1)
df

                 Cost  Price  Sold   Gross    Net    Margin    Note
Date       Part
2020-03-01 A-01  0.24   0.75    98   73.50  49.98  0.680000    High
           A-02  0.55   0.98    78   76.44  33.54  0.438776  Medium
           B-02  3.98   5.02    15   75.30  15.60  0.207171     Low
2020-03-02 A-01  0.25   0.76   105   79.80  53.55  0.671053    High
           B-02  3.80   5.00    25  125.00  30.00  0.240000     Low
2020-03-03 A-01  0.22   0.80   105   84.00  60.90  0.725000    High
           A-02  0.61   1.02    55   56.10  22.55  0.401961  Medium

## Summary

Look how far you're coming along! Before this module, all of your data would have been in NumPy with no row/column information!

Now our analysis can start to take form based upon these foundations.

We're already able to do so much! Next is SQL-like functionality.